Revit 2027 API
Rebar.GetSpliceStaggerLength Method
 Gets the stagger length that is used for the specified end - 0 for start, 1 for end.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double GetSpliceStaggerLength(
	int barEnd
)
Public Function GetSpliceStaggerLength (
	barEnd As Integer
) As Double
public:
double GetSpliceStaggerLength(
	int barEnd
)
member GetSpliceStaggerLength :
        barEnd : int -> float
Parameters
barEnd Int32
 The end where the splice is - 0 for start, 1 for end.
Return Value
Double
 Returns the stagger length that is used for the specified end - 0 for start, 1 for end.
Exceptions
Exception | Condition
ArgumentException |  There is no splice at the specified end.
ArgumentOutOfRangeException |  barEnd must be 0 or 1.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace